#pragma once

// Name: Torchlight3, Version: 4.26.1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Frontiers.PlayerComponent
// 0x0000 (FullSize[0x00B0] - InheritedSize[0x00B0])
class UPlayerComponent : public UActorComponent
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.PlayerComponent");
		return ptr;
	}



	class ATLPlayerController* GetTLPlayerController();
	class ATLCharacter* GetTLCharacter();
	class APlayerController* GetPlayerController();
	class APawn* GetPawn();
	class AController* GetController();
};

// Class Frontiers.AchievementManager
// 0x0060 (FullSize[0x0110] - InheritedSize[0x00B0])
class UAchievementManager : public UPlayerComponent
{
public:
	unsigned char                                      UnknownData_G0JU[0x60];                                    // 0x00B0(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AchievementManager");
		return ptr;
	}



};

// Class Frontiers.ActiveTrait
// 0x0108 (FullSize[0x01B8] - InheritedSize[0x00B0])
class UActiveTrait : public UActorComponent
{
public:
	unsigned char                                      UnknownData_PJW2[0x8];                                     // 0x00B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnRepValue;                                                // 0x00B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnRepMaxValue;                                             // 0x00C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnHitMin;                                                  // 0x00D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnHitMax;                                                  // 0x00E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnRateChanged;                                             // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GFP4[0x8];                                     // 0x0108(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FActiveTraitValue                           ActiveTraitValue;                                          // 0x0110(0x000C) (Edit, Net, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                              MaxValue;                                                  // 0x011C(0x0004) (Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       ActiveTraitRowName;                                        // 0x0120(0x0008) (Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                LockedRefCount;                                            // 0x0128(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                IncreaseLockedRefCount;                                    // 0x012C(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                DecreaseLockedRefCount;                                    // 0x0130(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ITP3[0x84];                                    // 0x0134(0x0084) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActiveTrait");
		return ptr;
	}



	float Store();
	void SetMaxValue();
	float Set(float NewValue);
	float Reset();
	void OnRep_Value();
	void OnRep_RowName();
	void OnRep_MaxValue();
	float STATIC_GetUIPercentDiscrete(class UActiveTrait* ActiveTrait);
	float STATIC_GetUIPercent(class UActiveTrait* ActiveTrait);
	struct FText STATIC_GetUILabel(class UActiveTrait* ActiveTrait);
	float GetMin();
	float GetMax();
	struct FText STATIC_GetDisplayName(class AActor* Actor, const struct FName& ActiveTraitName);
	float GetDeltaMax();
	float GetDelta();
	class UActiveTrait* STATIC_GetActiveTrait(class AActor* Actor, const struct FName& ActiveTraitName);
	float Get();
	float Add(float NewValue);
};

// Class Frontiers.ActiveTraitNoReplicate
// 0x0000 (FullSize[0x01B8] - InheritedSize[0x01B8])
class UActiveTraitNoReplicate : public UActiveTrait
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActiveTraitNoReplicate");
		return ptr;
	}



};

// Class Frontiers.ActiveTraitReplicateCheap
// 0x0008 (FullSize[0x01C0] - InheritedSize[0x01B8])
class UActiveTraitReplicateCheap : public UActiveTrait
{
public:
	unsigned char                                      ValueFraction;                                             // 0x01B8(0x0001) (Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_FGVC[0x7];                                     // 0x01B9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActiveTraitReplicateCheap");
		return ptr;
	}



	void OnRep_Fraction();
};

// Class Frontiers.ActiveTraitMonitorComponent
// 0x0020 (FullSize[0x00D0] - InheritedSize[0x00B0])
class UActiveTraitMonitorComponent : public UPlayerComponent
{
public:
	TArray<struct FActiveTraitMonitorAction>           Actions;                                                   // 0x00B0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bOnlyLocalPlayerOnClient;                                  // 0x00C0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PQS7[0x3];                                     // 0x00C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              TriggerCooldown;                                           // 0x00C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Frontiers_EAllowedType                             AllowedTickType;                                           // 0x00C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7FUL[0x7];                                     // 0x00C9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActiveTraitMonitorComponent");
		return ptr;
	}



	void OnRuleTriggered(const struct FName& Data);
};

// Class Frontiers.ActorChainInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActorChainInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorChainInterface");
		return ptr;
	}



};

// Class Frontiers.ActorFunctionLibraryShared
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActorFunctionLibraryShared : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorFunctionLibraryShared");
		return ptr;
	}



	class UObject* STATIC_GetClassDefaultObject(class UClass* Class);
};

// Class Frontiers.ActorFunctionLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActorFunctionLibrary : public UActorFunctionLibraryShared
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorFunctionLibrary");
		return ptr;
	}



	bool STATIC_TeleportTowardsPathable(class AActor* Actor, const struct FVector& Location, float MaxDistance);
	bool STATIC_TeleportTo(class AActor* Actor, const struct FVector& Location, bool bRequirePathable);
	bool STATIC_TeleportNearTo(class AActor* Actor, class AActor* Target, float MaxRadius, float MinDistance, int MaxAttempts);
	void STATIC_SortActorsByDistance(const struct FVector& Location, TArray<class AActor*>* ActorsToSort);
	void STATIC_SetSelectedByMeshParameter(class AActor* Actor, bool bSet);
	void STATIC_SetSelectedByCustomDepthStencil(class AActor* Actor, bool bSet);
	void STATIC_ResetPlayerClickTrace(class AActor* Actor);
	int STATIC_RandomIntegerFromStreamFullRange(const struct FRandomStream& RandomStream);
	void STATIC_PickRandomArrayIndex(TArray<int> TargetArray, int* Item);
	bool STATIC_IsPawnInMapworks(class AActor* Actor);
	bool STATIC_IsHardcore(class AActor* Actor);
	bool STATIC_IsActorWithinRange(class AActor* Actor, const struct FVector& Location, float Distance, float MinDistance);
	bool STATIC_IsActorWithinAngleRange(class AActor* Actor, const struct FVector& Location, float AngleDegrees);
	bool STATIC_IsActorOwnerLocal(class AActor* Actor);
	class AActor* STATIC_GetPlayerInSameArea(class AActor* AreaContextActor);
	struct FVector STATIC_GetLocationInFrontOfActor(class AActor* Actor, const struct FVector& Offset);
	struct FVector STATIC_GetFeetLocation(class AActor* Actor);
	TArray<class AActor*> STATIC_GetAreaActorsByType(class AActor* ReferenceActor, class UClass* ActorClass);
	void STATIC_ForceDestroyComponent(class UActorComponent* Component);
	void STATIC_DisablePlayerClickTrace(class AActor* Actor);
	void STATIC_DisableCollisionAndNavigation(class AActor* InActor);
	bool STATIC_AreActorsWithinRange(class AActor* First, class AActor* Second, float Distance, float MinDistance);
	bool STATIC_AreActorsWithinAngleRange(class AActor* Source, class AActor* Target, float AngleDegrees);
};

// Class Frontiers.ActorLimiter
// 0x00A0 (FullSize[0x0150] - InheritedSize[0x00B0])
class UActorLimiter : public UActorComponent
{
public:
	unsigned char                                      UnknownData_1D38[0x20];                                    // 0x00B0(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<struct FVector, struct FPrePickedActorClass>  PrePickedClasses;                                          // 0x00D0(0x0050) (Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_RXJ6[0x30];                                    // 0x0120(0x0030) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorLimiter");
		return ptr;
	}



};

// Class Frontiers.ActorMortalityComponent
// 0x00D8 (FullSize[0x0188] - InheritedSize[0x00B0])
class UActorMortalityComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    PreDeathDelegate;                                          // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnDeathDelegate;                                           // 0x00C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    PostDeathDelegate;                                         // 0x00D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    ClientDestroyDeadDelegate;                                 // 0x00E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnReviveDelegate;                                          // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              AllyReviveStatusEffects;                                   // 0x0100(0x0010) (Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BB97[0x40];                                    // 0x0110(0x0040) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDeathInfo                                  DeathInfo;                                                 // 0x0150(0x0018) (Edit, Net, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TEnumAsByte<Engine_ECollisionChannel>              DeadCollisionChannel;                                      // 0x0168(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BAMC[0x3];                                     // 0x0169(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       DeadCollisionProfileName;                                  // 0x016C(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_H480[0x4];                                     // 0x0174(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      OnReviveStatusEffect;                                      // 0x0178(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ReviveStatusDuration;                                      // 0x0180(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_C43S[0x4];                                     // 0x0184(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorMortalityComponent");
		return ptr;
	}



	void ServerGiveUpOnAllyRevive();
	void STATIC_ReviveActor(class AActor* Actor);
	void OnRep_DeathInfo();
	void MulticastReviveActorInternal();
	void MarkAllyReviveExpired();
	void STATIC_KillActor(class AActor* Actor, class AActor* Attacker, class USkill* Skill, bool bIsOverkill);
	bool IsDyingOrDead();
	float STATIC_GetTimeSinceActorDeath(class AActor* Actor);
	float STATIC_GetActorDeathTimestamp(class AActor* Actor);
	void ClientAllyReviveExpired();
	bool STATIC_ActorIsDyingOrDead(class AActor* Actor);
};

// Class Frontiers.ActorProxy
// 0x0028 (FullSize[0x0248] - InheritedSize[0x0220])
class AActorProxy : public AActor
{
public:
	unsigned char                                      UnknownData_HWGW[0x8];                                     // 0x0220(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FGameplayTagContainer                       GameplayTags;                                              // 0x0228(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorProxy");
		return ptr;
	}



};

// Class Frontiers.ActorProxyNode
// 0x0080 (FullSize[0x02A0] - InheritedSize[0x0220])
class AActorProxyNode : public AActor
{
public:
	TArray<class AActor*>                              SpawnedActors;                                             // 0x0220(0x0010) (ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                               bSpawnWithRandomRotation;                                  // 0x0230(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_603X[0x3];                                     // 0x0231(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MaxYawRotation;                                            // 0x0234(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyEntry>                    ActorProxies;                                              // 0x0238(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyNodeMonsterSpawnerEntry>  MonsterSpawners;                                           // 0x0248(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyNodeGadgetEntry>          Gadgets;                                                   // 0x0258(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyNodeBreakableEntry>       Breakables;                                                // 0x0268(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyNodeHazardEntry>          Hazards;                                                   // 0x0278(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorProxyNodeGameplayTagEntry>     ActorLimitGameplayTags;                                    // 0x0288(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_46IR[0x8];                                     // 0x0298(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.ActorProxyNode");
		return ptr;
	}



};

// Class Frontiers.SpawnEntryBase
// 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
class USpawnEntryBase : public UObject
{
public:
	unsigned char                                      UnknownData_G5L5[0x8];                                     // 0x0028(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnEntryBase");
		return ptr;
	}



};

// Class Frontiers.SpawnDataEntryGotoSpawnRowBase
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class USpawnDataEntryGotoSpawnRowBase : public USpawnEntryBase
{
public:
	unsigned char                                      UnknownData_IX6S[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnDataEntryGotoSpawnRowBase");
		return ptr;
	}



};

// Class Frontiers.SpawnDataEntryGotoAffixSpawnRow
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class USpawnDataEntryGotoAffixSpawnRow : public USpawnDataEntryGotoSpawnRowBase
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnDataEntryGotoAffixSpawnRow");
		return ptr;
	}



};

// Class Frontiers.SpawnDataEntryAddAffixByName
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class USpawnDataEntryAddAffixByName : public USpawnEntryBase
{
public:
	unsigned char                                      UnknownData_B465[0x8];                                     // 0x0030(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnDataEntryAddAffixByName");
		return ptr;
	}



};

// Class Frontiers.SpawnDataEntryGameplayTags
// 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
class USpawnDataEntryGameplayTags : public USpawnEntryBase
{
public:
	unsigned char                                      UnknownData_CM3F[0x20];                                    // 0x0030(0x0020) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnDataEntryGameplayTags");
		return ptr;
	}



};

// Class Frontiers.SpawnDataEntryAddAffixByFilter
// 0x0000 (FullSize[0x0050] - InheritedSize[0x0050])
class USpawnDataEntryAddAffixByFilter : public USpawnDataEntryGameplayTags
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SpawnDataEntryAddAffixByFilter");
		return ptr;
	}



};

// Class Frontiers.AllowedTypeFunctionLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UAllowedTypeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AllowedTypeFunctionLibrary");
		return ptr;
	}



	bool STATIC_IsAllowedOnServer(Frontiers_EAllowedType Allowed);
	bool STATIC_IsAllowedOnClient(Frontiers_EAllowedType Allowed);
	bool STATIC_IsAllowed(class UObject* Context, Frontiers_EAllowedType Allowed);
};

// Class Frontiers.SkillShape
// 0x0068 (FullSize[0x0288] - InheritedSize[0x0220])
class ASkillShape : public AActor
{
public:
	unsigned char                                      UnknownData_2EKF[0x28];                                    // 0x0220(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class AActor*>                              OverlappedActors;                                          // 0x0248(0x0010) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class USkillDelegate*                              SkillDelegate;                                             // 0x0258(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bDestroySelfOnOverlap;                                     // 0x0260(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bAllowDeadActorNotifyOnEndOverlap;                         // 0x0261(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bSortTargetsByDistanceToOwner;                             // 0x0262(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bCheckLineOfSight;                                         // 0x0263(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_WASI[0x4];                                     // 0x0264(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FActorStatusEffectPair>              StatusEffects;                                             // 0x0268(0x0010) (ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_0KF1[0x10];                                    // 0x0278(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SkillShape");
		return ptr;
	}



	void RequestActivation();
};

// Class Frontiers.AllyReviveShape
// 0x0058 (FullSize[0x02E0] - InheritedSize[0x0288])
class AAllyReviveShape : public ASkillShape
{
public:
	class UTLDecalComponent*                           ReviveExpireTimerDecal;                                    // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTLDecalComponent*                           RevivingTimerDecal;                                        // 0x0290(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      ReviveExpireStatusEffectClass;                             // 0x0298(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      RevivingStatusEffectClass;                                 // 0x02A0(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      CanBeRevivedStatusEffectClass;                             // 0x02A8(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ReviveDuration;                                            // 0x02B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ReviveExpireDuration;                                      // 0x02B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                            _;                                                        // 0x02B8(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CurrentReviveExpireDuration;                               // 0x02C0(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_OVTI[0x1C];                                    // 0x02C4(0x001C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AllyReviveShape");
		return ptr;
	}



	void OnRevived(class APawn* Pawn);
	class UTLDecalComponent* GetRevivingDecal();
	class UTLDecalComponent* GetReviveRangeDecal();
	class UTLDecalComponent* GetReviveExpireDecal();
	bool STATIC_CanBeRevivedByAlly(class AActor* DeadActor);
};

// Class Frontiers.AnimatedMesh
// 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
class AAnimatedMesh : public AActor
{
public:
	class UFXSkeletalMeshComponent*                    FXMesh;                                                    // 0x0220(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimatedMesh");
		return ptr;
	}



	class AAnimatedMesh* STATIC_SpawnAnimatedMesh(class UObject* WorldContextObject, const struct FSpawnAnimatedMeshParams& InParams, const struct FString& DebugContext);
};

// Class Frontiers.AnimNotify_AttachActor
// 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
class UAnimNotify_AttachActor : public UAnimNotifyState
{
public:
	class UClass*                                      ActorClass;                                                // 0x0030(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Frontiers_EAllowedType                             Allowed;                                                   // 0x0038(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LTLM[0x3];                                     // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       AttachmentBone;                                            // 0x003C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Offset;                                                    // 0x0044(0x000C) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0050(0x000C) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZYJI[0x4];                                     // 0x005C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_AttachActor");
		return ptr;
	}



	void DestroyAttachment(class AActor* Owner);
};

// Class Frontiers.AnimNotify_HideAttachedActors
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UAnimNotify_HideAttachedActors : public UAnimNotifyState
{
public:
	Frontiers_EAllowedType                             Allowed;                                                   // 0x0030(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PCPS[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_HideAttachedActors");
		return ptr;
	}



};

// Class Frontiers.SkillAnimNotify
// 0x0020 (FullSize[0x0058] - InheritedSize[0x0038])
class USkillAnimNotify : public UAnimNotify
{
public:
	unsigned char                                      UnknownData_3Z7O[0x8];                                     // 0x0038(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FNotifyCondition>                    Conditions;                                                // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                               bPlayInEditorPreview;                                      // 0x0050(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9YUB[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SkillAnimNotify");
		return ptr;
	}



};

// Class Frontiers.SkillAnimNotify_Cosmetic
// 0x0000 (FullSize[0x0058] - InheritedSize[0x0058])
class USkillAnimNotify_Cosmetic : public USkillAnimNotify
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.SkillAnimNotify_Cosmetic");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_CameraShake
// 0x0020 (FullSize[0x0078] - InheritedSize[0x0058])
class UAnimNotify_CameraShake : public USkillAnimNotify_Cosmetic
{
public:
	struct FCameraShakeData                            ShakeData;                                                 // 0x0058(0x0020) (Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_CameraShake");
		return ptr;
	}



	void STATIC_TLPlayWorldCameraShake(class UObject* WorldContextObject, class UClass* Shake, const struct FVector& Epicenter, float InnerRadius, float OuterRadius, class AActor* OwnerRequired, float Falloff, bool bOrientShakeTowardsEpicenter);
};

// Class Frontiers.AnimNotify_DeactivateParticles
// 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
class UAnimNotify_DeactivateParticles : public UAnimNotify
{
public:
	bool                                               bDetachParticles;                                          // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YMHW[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_DeactivateParticles");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_DebugDraw
// 0x0010 (FullSize[0x0068] - InheritedSize[0x0058])
class UAnimNotify_DebugDraw : public USkillAnimNotify_Cosmetic
{
public:
	float                                              Radius;                                                    // 0x0058(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Duration;                                                  // 0x005C(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAtSource;                                                 // 0x0060(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5JXR[0x7];                                     // 0x0061(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_DebugDraw");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_DisableOcclusion
// 0x0000 (FullSize[0x0058] - InheritedSize[0x0058])
class UAnimNotify_DisableOcclusion : public USkillAnimNotify
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_DisableOcclusion");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_DropLoot
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UAnimNotify_DropLoot : public UAnimNotify
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_DropLoot");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_EndSlot
// 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
class UAnimNotify_EndSlot : public UAnimNotify
{
public:
	struct FName                                       SlotName;                                                  // 0x0038(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BlendTime;                                                 // 0x0040(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_B72S[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_EndSlot");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_Harvest
// 0x0008 (FullSize[0x0060] - InheritedSize[0x0058])
class UAnimNotify_Harvest : public USkillAnimNotify
{
public:
	float                                              HarvestPoints;                                             // 0x0058(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5D1U[0x4];                                     // 0x005C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_Harvest");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_Pause
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UAnimNotify_Pause : public UAnimNotify
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_Pause");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_PlayAnimationOnChildMesh
// 0x0018 (FullSize[0x0050] - InheritedSize[0x0038])
class UAnimNotify_PlayAnimationOnChildMesh : public UAnimNotify
{
public:
	struct FGameplayTag                                AnimInstanceTag;                                           // 0x0038(0x0008) (Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                                AnimToPlayTag;                                             // 0x0040(0x0008) (Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BasePlayRate;                                              // 0x0048(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SC39[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_PlayAnimationOnChildMesh");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_Selectable
// 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
class UAnimNotify_Selectable : public UAnimNotify
{
public:
	bool                                               bSelectable;                                               // 0x0038(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_7POG[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_Selectable");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_SetMeshVisibility
// 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
class UAnimNotify_SetMeshVisibility : public UAnimNotify
{
public:
	bool                                               bVisible;                                                  // 0x0038(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_3OSZ[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_SetMeshVisibility");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_SetScalarMaterialParamter
// 0x0018 (FullSize[0x0070] - InheritedSize[0x0058])
class UAnimNotify_SetScalarMaterialParamter : public USkillAnimNotify
{
public:
	TArray<struct FName>                               MaterialParameter;                                         // 0x0058(0x0010) (Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                              ScalarValue;                                               // 0x0068(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9MQP[0x4];                                     // 0x006C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_SetScalarMaterialParamter");
		return ptr;
	}



};

// Class Frontiers.AnimNotify_SpawnAnimatedMesh
// 0x0028 (FullSize[0x0080] - InheritedSize[0x0058])
class UAnimNotify_SpawnAnimatedMesh : public USkillAnimNotify_Cosmetic
{
public:
	bool                                               bWorldSpace;                                               // 0x0058(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseCharacterAnimPlayRate;                                 // 0x0059(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TPCU[0x6];                                     // 0x005A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USkeletalMesh*                               MeshToSpawn;                                               // 0x0060(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                           Material;                                                  // 0x0068(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                           AnimationToPlay;                                           // 0x0070(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SocketName;                                                // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.AnimNotify_SpawnAnimatedMesh");
		return ptr;
	}



};

// Class Frontiers.Area
// 0x0090 (FullSize[0x00B8] - InheritedSize[0x0028])
class UArea : public UObject
{
public:
	int                                                MaxAttempts;                                               // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6IJO[0x8];                                     // 0x002C(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Seed;                                                      // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRandomSeed;                                               // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8AQX[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      TemplateClass;                                             // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              ConductorHandlers;                                         // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ENGP[0x8];                                     // 0x0058(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FMapWorksSpawnEntry>                 DefaultMapWorksSpawnEntries;                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FMinionSpawnEntry>                   DefaultPetSpawnEntries;                                    // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FActorLimit>                         ActorLimits;                                               // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bAllowFogOfWar;                                            // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bMonsterLevelsIncreaseToCenter;                            // 0x0091(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Q2VH[0x6];                                     // 0x0092(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FRuleSetMetaData>                    GraphRulesetReferences;                                    // 0x0098(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TArray<struct FRuleSetMetaData>                    RulesetReferences;                                         // 0x00A8(0x0010) (ZeroConstructor, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Frontiers.Area");
		return ptr;
	}



	void CompileRules();
	void STATIC_CompileAreaBlueprintRules(class UBlueprint* TargetArea);
	void AddRuleFromMetadata(struct FRuleSetMetaData* MetaData);
	void AddRule(class UClass* RuleSetClass, class ADRLGRuleSet* RuleSetOverride, Frontiers_EDRLGRuleSetMethod Method, int Attempts, int RequiredSuccessfulAttempts, bool bSkipToNextAfterRequiredRuleSuccess, bool bAttemptsTimesSize, bool bRequiredTimesSize, bool bAttemptsTimesForts, bool bRequiredTimesFortCount, Frontiers_EWarpToIndex WarpAddedByRuleSet, bool bStopHere);
};

// Class Frontiers.TLCharacter
// 0x0278 (FullSize[0x0730] - InheritedSize[0x04B8])
class ATLCharacter : public ACharacter
{
public:
	unsigned char                                      UnknownData_WNOT[0x8];                                     // 0x04B8(0x0008) Fix Super Size
	unsigned char                                      UnknownData_8O0N[0x50];                                    // 0x04C0(0x0050) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               NeverShowOcclusionShader;                                  // 0x0510(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H6GU[0x3];                                     // 0x0511(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              SpawnTime;                                                 // 0x0514(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BaseMovementSpeed;                                         // 0x0518(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIgnoreEnergyCosts;                                        // 0x051C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ON16[0x1];                                     // 0x051D(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               bIsTargetable;                                             // 0x051E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JWCG[0x1];                                     // 0x051F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UBehaviorTree*                               BehaviorTree;                                              // 0x0520(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkillManager*                               SkillManager;                                              // 0x0528(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     DefaultPortrait;                                           // 0x0530(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      LightRigBlueprint;                                         // 0x0538(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      PhotoboothClass;                                           // 0x0540(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LegacyCapsuleRadius;                                       // 0x0548(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XRBB[0xAC];                                    // 0x054C(0x00AC) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               bSaveCharacter;                                            // 0x05F8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DEC5[0x17];                                    // 0x05F9(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class APlayerLight*                                SpawnedLightRig;                                           // 0x0610(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMonsterSpawner*                             SpawnedFrom;                                               // 0x0618(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorMortalityComponent*                    ActorMortalityComponent;                                   // 0x0620(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBossMonsterComponent*                       BossMonsterComponent;                                      // 0x0628(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMonsterChampionComponent*                   MonsterChampionComponent;                                  // 0x0630(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveTraitsTableRowHandle>         ActiveTraitRows;                                           // 0x0638(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	Frontiers_ETLTeam                                  Team;                                                      // 0x0648(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_XTJQ[0x7];                                     // 0x0649(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTraits*                                     Traits;                                                    // 0x0650(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTLInventory*                                Inventory;                                                 // 0x0658(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTLCombatActorComponent*                     CombatFX;                                                  // 0x0660(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                       GameplayTags;                                              // 0x0668(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_9NAZ[0x4];                                     // 0x0688(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       DataRowName;                                               // 0x068C(0x0008) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_XZ7R[0x4];                                     // 0x0694(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FFMODEventReference                         FootstepEvent;                                             // 0x0698(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bAllowMeshOffsetFromRoot;                                  // 0x06B0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NY86[0x7];                                     // 0x06B1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<TWeakObjectPtr<class UPrimitiveComponent>>  TempCollisionIgnores;                                      // 0x06B8(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BDZD[0x8];                                     // 0x06C8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTLRepMovement                              TLReplicatedMovement;                                      // 0x06D0(0x001C) (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_4L9P[0x4];                                     // 0x06EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UCapsuleComponent*                           CachedHitboxCapsule;                                       // 0x06F0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_YTI0[0x4];                                     // 0x06F8(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MovementReplicationPerSecond;                              // 0x06FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MovementReplicationToleranceSquared;                       // 0x0700(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NV9Y[0x1C];                                    // 0x0704(0x001C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              GroundZOffsetOverride;                                     // 0x0720(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsSelected;                                               // 0x0724(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_02V7[0xB];                                     // 0x0725(0x000B) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
