#pragma once

// Name: Torchlight3, Version: 4.26.1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class FrontiersUI.BaseSingleSlotWidget
// 0x0010 (FullSize[0x0130] - InheritedSize[0x0120])
class UBaseSingleSlotWidget : public UContentWidget
{
public:
	unsigned char                                      UnknownData_SOK5[0x10];                                    // 0x0120(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BaseSingleSlotWidget");
		return ptr;
	}



};

// Class FrontiersUI.ListWidget
// 0x0120 (FullSize[0x0250] - InheritedSize[0x0130])
class UListWidget : public UBaseSingleSlotWidget
{
public:
	class UClass*                                      WidgetClass;                                               // 0x0130(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       PanelName;                                                 // 0x0138(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               WrapSelection;                                             // 0x0140(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FrontiersUI_EListDirection                         ListDirection;                                             // 0x0141(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5RD8[0x2];                                     // 0x0142(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                NumGridColumns;                                            // 0x0144(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumMinimumGridRows;                                        // 0x0148(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FrontiersUI_EUINavigationScheme                    NavigationScheme;                                          // 0x014C(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<SlateCore_EHorizontalAlignment>        WidgetHorizontalAlignment;                                 // 0x014D(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<SlateCore_EVerticalAlignment>          WidgetVerticalAlignment;                                   // 0x014E(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_C8TM[0x1];                                     // 0x014F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateChildSize                             WidgetSize;                                                // 0x0150(0x0008) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bReverseFillHorizontal;                                    // 0x0158(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bReverseFillVertical;                                      // 0x0159(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bInvalidateOnRefresh;                                      // 0x015A(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLazyLoad;                                                 // 0x015B(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LazyLoadPadding;                                           // 0x015C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxWidgetsCreatedPerFrame;                                 // 0x0160(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             GetNextListBinding;                                        // 0x0164(0x0010) (Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FQ2H[0x4];                                     // 0x0174(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                DefaultWidgetSelectionIndex;                               // 0x0178(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_BWAC[0x2C];                                    // 0x017C(0x002C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UWidget*                                     SelectedWidget;                                            // 0x01A8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                                  ScrollBox;                                                 // 0x01B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                     LoadingSpinner;                                            // 0x01B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                                PanelWidget;                                               // 0x01C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_KSSQ[0x78];                                    // 0x01C8(0x0078) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    WidgetFocusEvent;                                          // 0x0240(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ListWidget");
		return ptr;
	}



	void WidgetFocusEvent__DelegateSignature(class UWidget* Widget, bool bHasFocus, int Index);
	void SetLoadingSpinner(class UWidget* InLoadingSpinner);
	class UWidget* SetFocusedWidget(int Index);
	void OnScrolled(float ScrollOffset);
	int GetNumValidWidgets();
	int GetFocusedWidgetIndex();
	void EnsureWidgetSelectedAndFocused(bool bSelectLast);
	void EnsureWidgetSelected(bool bSelectLast);
};

// Class FrontiersUI.TLUserWidget
// 0x03E0 (FullSize[0x0640] - InheritedSize[0x0260])
class UTLUserWidget : public UUserWidget
{
public:
	bool                                               bIsModal;                                                  // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCannotBeUnfocused;                                        // 0x0261(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bConsumeAllMouseInput;                                     // 0x0262(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHideHUDWhileVisible;                                      // 0x0263(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAcceptInputKeyRepeat;                                     // 0x0264(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bMouseKeyboardActionsRequireHover;                         // 0x0265(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCanBeClosed;                                              // 0x0266(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHideInsteadOfClose;                                       // 0x0267(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FrontiersUI_EUINavigationScheme                    NavigationScheme;                                          // 0x0268(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7LTF[0x3];                                     // 0x0269(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ServerRPCThrottleMilliseconds;                             // 0x026C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                        DragMouseButton;                                           // 0x0270(0x0018) (Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIButtonAction                             BackAction;                                                // 0x0288(0x00F8) (Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FUIButtonAction                             PrimaryAction;                                             // 0x0380(0x00F8) (Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWidget>                      FocusReturn;                                               // 0x0478(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                            SelectWidgetAnimation;                                     // 0x0480(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    BlueprintOnClosedEvent;                                    // 0x0488(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Z1QG[0x10];                                    // 0x0498(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<FrontiersUI_EUIAudioSlot, struct FFMODEventReference> AudioMap;                                                  // 0x04A8(0x0050) (Edit, Protected, NativeAccessSpecifierProtected)
	struct FFMODEventReference                         ShownSnapshot;                                             // 0x04F8(0x0018) (Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_SJ7H[0x8];                                     // 0x0510(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      ShownStatusEffectClass[0x28];                              // 0x0510(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	class UStatusEffect*                               ShownStatusEffect;                                         // 0x0540(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_345S[0x8];                                     // 0x0548(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UWidgetAnimation*                            ActiveHideAnimation;                                       // 0x0550(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                                 TooltipAnchor;                                             // 0x0558(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bShowFocusWhenHovered;                                     // 0x0560(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_993I[0xA7];                                    // 0x0561(0x00A7) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FWidgetTickHandle                           PrimaryTick;                                               // 0x0608(0x0028) (Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_TE3B[0x10];                                    // 0x0630(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TLUserWidget");
		return ptr;
	}



	void PlayAudioEvent(FrontiersUI_EUIAudioSlot FMODSlot);
	bool PerformButtonAction(const struct FUIButtonAction& Action);
	void OnTooltipMenuAnchorOpenChanged(bool bIsOpen);
	bool OnNavigation(SlateCore_EUINavigation NavDirection);
	void OnDragOperationCancelled(class UDragDropOperation* DragDropOperation);
	void OnCharacterChanged(class ATLCharacter* NewCharacter);
	bool IsSelectedInList();
	bool IsHiddenOrHiding();
	class UMenuAnchor* GetTooltipAnchor();
	UMG_ESlateVisibility GetSteamUIVisibility();
	class UWidgetAnimation* GetShowAnimation();
	UMG_ESlateVisibility GetSelectedVisibility();
	class ATLPlayerController* GetOwningTLPlayer();
	class UUserWidget* GetOrCreateTooltipWidget();
	UMG_ESlateVisibility GetMouseKeyboardUIVisibility();
	UMG_ESlateVisibility GetMouseKeyboardInteractiveUIVisibility();
	class UWidgetAnimation* GetListSelectAnimation();
	float GetHoldActionProgress();
	class UWidgetAnimation* GetHideAnimation();
	UMG_ESlateVisibility GetGamepadUIVisibility();
	UMG_ESlateVisibility GetFocusSelectionVisibility();
	class UWidgetAnimation* GetFocusAnimation();
	class UTLBaseHUD* GetBaseHUD();
	void CloseWidget();
	void BlueprintOnShown();
	void BlueprintOnHidden();
};

// Class FrontiersUI.AccountCreatePanel
// 0x0740 (FullSize[0x0D80] - InheritedSize[0x0640])
class UAccountCreatePanel : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_TQF5[0x10];                                    // 0x0640(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FModalWidgetDefinition                      FailedToGetLoginTokenModal;                                // 0x0650(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FModalWidgetDefinition                      FailedToGetLinkCodeModal;                                  // 0x08B0(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FModalWidgetDefinition                      FailedToCreateShadowAccountModal;                          // 0x0B10(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_U5WZ[0x10];                                    // 0x0D70(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AccountCreatePanel");
		return ptr;
	}



	void OnCancel();
	void CreateArcAccount(const struct FString& SessionId);
};

// Class FrontiersUI.AccountLinkPanel
// 0x0138 (FullSize[0x0778] - InheritedSize[0x0640])
class UAccountLinkPanel : public UTLUserWidget
{
public:
	struct FText                                       LinkCodeFormatString;                                      // 0x0640(0x0018) (Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_Q300[0x28];                                    // 0x0658(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FUIButtonAction                             FollowLinkAction;                                          // 0x0680(0x00F8) (Edit, BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AccountLinkPanel");
		return ptr;
	}



	void OnOpenLink();
	void OnContinue();
	struct FText GetLinkCodeText();
};

// Class FrontiersUI.AccountOptionsModalWidget
// 0x0BC8 (FullSize[0x1208] - InheritedSize[0x0640])
class UAccountOptionsModalWidget : public UTLUserWidget
{
public:
	struct FModalWidgetDefinition                      UnlinkFirstWarningModal;                                   // 0x0640(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModalWidgetDefinition                      UnlinkSecondWarningModal;                                  // 0x08A0(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModalWidgetDefinition                      UnlinkCompleteModal;                                       // 0x0B00(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModalWidgetDefinition                      UnlinkFailedModal;                                         // 0x0D60(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AJTK[0x248];                                   // 0x0FC0(0x0248) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AccountOptionsModalWidget");
		return ptr;
	}



	void UpdateSinglePlayerHeroCount(int HeroCount);
	void UpdateMultiplayerHeroCount(int HeroCount);
	void UnlinkAccountModals();
	void UnlinkAccount();
	void SetCurrentSelectedListWidget(class UListWidget* ListWidget);
	bool IsUnlinkButtonEnabled();
	void HideMultiplayerLoadingSpinner();
	int GetSinglePlayerCharacterCount();
	class UListWidget* GetButtonList();
};

// Class FrontiersUI.AccountResetModalWidget
// 0x0730 (FullSize[0x0D70] - InheritedSize[0x0640])
class UAccountResetModalWidget : public UTLUserWidget
{
public:
	bool                                               bIsMultiplayerReset;                                       // 0x0640(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8OMC[0x7];                                     // 0x0641(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FModalWidgetDefinition                      ConfirmModalDefinition;                                    // 0x0648(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModalWidgetDefinition                      ConfirmCompleteModalDefinition;                            // 0x08A8(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModalWidgetDefinition                      ResetFailedModalDefinition;                                // 0x0B08(0x0260) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0B2U[0x8];                                     // 0x0D68(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AccountResetModalWidget");
		return ptr;
	}



	void StartResetFlow();
	struct FString GetTextToMatch();
	float GetResetHoldTime();
};

// Class FrontiersUI.ActiveTraitBarWidget
// 0x0238 (FullSize[0x0878] - InheritedSize[0x0640])
class UActiveTraitBarWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_UY2O[0x30];                                    // 0x0640(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FActiveTraitsTableRowHandle                 ActiveTraitRow;                                            // 0x0670(0x0010) (Edit, NativeAccessSpecifierPublic)
	bool                                               bUsePlayerEnergy;                                          // 0x0680(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsDiscrete;                                               // 0x0681(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<Slate_EProgressBarFillType>            ProgressBarFillType;                                       // 0x0682(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3ID8[0x5];                                     // 0x0683(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UWidgetAnimation*                            ResourceFilledAnimation;                                   // 0x0688(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                            ResourceNoLongerFilledAnimation;                           // 0x0690(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                            ResourceFullLoopAnimation;                                 // 0x0698(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                            ResourceIncreasingAnimation;                               // 0x06A0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UUserWidget>                  AnimatedWidget;                                            // 0x06A8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProgressBarStyle                           ProgressBarStyle;                                          // 0x06B0(0x01A0) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UClass*                                      TooltipWidgetClass;                                        // 0x0850(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActiveTraitTooltipWidget*                   ActiveTraitTooltipWidget;                                  // 0x0858(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProgressBar*                                ProgressBar;                                               // 0x0860(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_YDBT[0x10];                                    // 0x0868(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ActiveTraitBarWidget");
		return ptr;
	}



	struct FLinearColor GetResourceColor();
	class UProgressBar* GetProgressBar();
};

// Class FrontiersUI.TooltipWidget
// 0x0040 (FullSize[0x0680] - InheritedSize[0x0640])
class UTooltipWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_450G[0x40];                                    // 0x0640(0x0040) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TooltipWidget");
		return ptr;
	}



	void SetText(const struct FText& Text);
	struct FText GetTextFromDelegate();
	class UTLRichTextBlock* GetTextBlock();
};

// Class FrontiersUI.ActiveTraitTooltipWidget
// 0x0000 (FullSize[0x0680] - InheritedSize[0x0680])
class UActiveTraitTooltipWidget : public UTooltipWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ActiveTraitTooltipWidget");
		return ptr;
	}



	class UTLTextBlock* GetTraitNameBlock();
	class UTraitTextBlock* GetMaxTraitText();
	class UActiveTraitTextBlock* GetCurrentTraitText();
};

// Class FrontiersUI.ActiveTraitWidgetInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActiveTraitWidgetInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ActiveTraitWidgetInterface");
		return ptr;
	}



	void OnActiveTraitChanged(class UActiveTrait* InActiveTrait);
};

// Class FrontiersUI.ActorDebugInfoWidget
// 0x0008 (FullSize[0x0648] - InheritedSize[0x0640])
class UActorDebugInfoWidget : public UTLUserWidget
{
public:
	TWeakObjectPtr<class AActor>                       Target;                                                    // 0x0640(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ActorDebugInfoWidget");
		return ptr;
	}



};

// Class FrontiersUI.AffixListWidget
// 0x0000 (FullSize[0x0250] - InheritedSize[0x0250])
class UAffixListWidget : public UListWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AffixListWidget");
		return ptr;
	}



};

// Class FrontiersUI.LockedAffixListWidget
// 0x0000 (FullSize[0x0250] - InheritedSize[0x0250])
class ULockedAffixListWidget : public UAffixListWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.LockedAffixListWidget");
		return ptr;
	}



};

// Class FrontiersUI.AffixWidget
// 0x0038 (FullSize[0x0678] - InheritedSize[0x0640])
class UAffixWidget : public UTLUserWidget
{
public:
	struct FText                                       AffixText;                                                 // 0x0640(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       SetNameText;                                               // 0x0658(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               bSetUnlocked;                                              // 0x0670(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GT7J[0x7];                                     // 0x0671(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AffixWidget");
		return ptr;
	}



	class UTLRichTextBlock* GetSetNameTextBlock();
	class UTLRichTextBlock* GetLockedTextBlock();
	class UTLImage* GetIconImage();
};

// Class FrontiersUI.LockedAffixWidget
// 0x0020 (FullSize[0x0698] - InheritedSize[0x0678])
class ULockedAffixWidget : public UAffixWidget
{
public:
	struct FText                                       UnlockLevelText;                                           // 0x0678(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	UMG_ESlateVisibility                               LockVisibility;                                            // 0x0690(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMG_ESlateVisibility                               UnlockedVisibility;                                        // 0x0691(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6L9U[0x6];                                     // 0x0692(0x0006) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.LockedAffixWidget");
		return ptr;
	}



};

// Class FrontiersUI.AllyInfoWidget
// 0x00D8 (FullSize[0x0718] - InheritedSize[0x0640])
class UAllyInfoWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_R7F3[0x30];                                    // 0x0640(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UMaterial*                                   PortraitBaseMaterial;                                      // 0x0670(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterial*                                   PortraitDesaturatedBaseMaterial;                           // 0x0678(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<FrontiersUI_EAllyHealthStatus, struct FSlateBrush> BorderBrushes;                                             // 0x0680(0x0050) (Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                              LowHealthPercent;                                          // 0x06D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMG_ESlateVisibility                               LowHealthVisibility;                                       // 0x06D4(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ZB18[0x33];                                    // 0x06D5(0x0033) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UProgressBar*                                HealthProgressBar;                                         // 0x0708(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                                  LevelText;                                                 // 0x0710(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AllyInfoWidget");
		return ptr;
	}



	void SetInstanceResetReadyState(bool bIsReady);
	void OnAllyEndPlay(class AActor* Actor, TEnumAsByte<Engine_EEndPlayReason> EndPlayReason);
	void OnAllyDeath(class APawn* Dying, class AActor* Attacker);
	class UTLImage* GetPortraitImage();
	class UTextBlock* GetNameText();
	class UTextBlock* GetLevelText();
	class UProgressBar* GetHealthProgressBar();
	class UTLImage* GetDifficultyWidget();
	class UWidget* GetDifficultyContainer();
	class UWidget* GetContainerWidget();
	class UTLBorder* GetBorderWidget();
};

// Class FrontiersUI.TLImage
// 0x0028 (FullSize[0x0238] - InheritedSize[0x0210])
class UTLImage : public UImage
{
public:
	class UMaterial*                                   Material;                                                  // 0x0210(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                                    NormalMap;                                                 // 0x0218(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     MaterialTextureParameterName;                              // 0x0220(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SKV3[0x8];                                     // 0x0230(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TLImage");
		return ptr;
	}



	void SetImageAsset(class UObject* TextureAsset, TEnumAsByte<SlateCore_ESlateBrushDrawType> DrawType, bool bAutoResize);
};

// Class FrontiersUI.AsyncImage
// 0x0060 (FullSize[0x0298] - InheritedSize[0x0238])
class UAsyncImage : public UTLImage
{
public:
	unsigned char                                      TextureAsset[0x28];                                        // 0x0238(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	struct FIconAsset                                  PendingIconAsset;                                          // 0x0260(0x0038) (Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.AsyncImage");
		return ptr;
	}



	void OnTextureLoaded();
};

// Class FrontiersUI.BaseListedObjectWidget
// 0x0008 (FullSize[0x0648] - InheritedSize[0x0640])
class UBaseListedObjectWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_0TJT[0x8];                                     // 0x0640(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BaseListedObjectWidget");
		return ptr;
	}



};

// Class FrontiersUI.BaseSkillBarWidget
// 0x0090 (FullSize[0x06D0] - InheritedSize[0x0640])
class UBaseSkillBarWidget : public UTLUserWidget
{
public:
	TArray<struct FClassSkillBarDefinition>            ClassSkillBars;                                            // 0x0640(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_G5A7[0x18];                                    // 0x0650(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<struct FName, class UPotionWidget*>           PotionWidgets;                                             // 0x0668(0x0050) (ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UClass*                                      PotionItemClass;                                           // 0x06B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      DefaultPotionWidget;                                       // 0x06C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                                 ResourceBar;                                               // 0x06C8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BaseSkillBarWidget");
		return ptr;
	}



	class UMessageWidget* GetStatusEffectMessage();
	TArray<class USkillWidget*> GetSkillWidgetsWithTags(const struct FGameplayTagContainer& Tags);
	class UPanelWidget* GetResourceBarPanel();
	class UPanelWidget* GetPotionWidgetPanel();
	class UClass* GetPotionWidgetClass(class UClass* InPotion);
	class USkillWidget* GetPortalSkillWidget();
	class UWidget* GetPortalSkillContainerWidget();
	class UActiveTraitBarWidget* GetHealthBar();
	class UUserWidget* GetEmberWeaponWidget();
	class UPanelWidget* GetEmberWeaponPanel();
	TArray<class USkillWidget*> GetAllSkillWidgets();
};

// Class FrontiersUI.TargetInfoWidgetContainer
// 0x00D8 (FullSize[0x0718] - InheritedSize[0x0640])
class UTargetInfoWidgetContainer : public UTLUserWidget
{
public:
	bool                                               bForceShow;                                                // 0x0640(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QEQ5[0x7];                                     // 0x0641(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<FrontiersUI_ETargetWidgetType, class UClass*> WidgetClasses;                                             // 0x0648(0x0050) (Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_I7X3[0x10];                                    // 0x0698(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<FrontiersUI_ETargetWidgetType, class UTargetInfoWidget*> Widgets;                                                   // 0x06A8(0x0050) (ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_WYTL[0x8];                                     // 0x06F8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTargetInfoWidget*                           CurrentTargetWidget;                                       // 0x0700(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                                PanelWidget;                                               // 0x0708(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                     OverallVisibilityContainer;                                // 0x0710(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TargetInfoWidgetContainer");
		return ptr;
	}



	void SetSelectedActorOverride(class AActor* Override);
	void OnSelectedActorDestroyed(class AActor* Actor);
	void OnSelectedActorChanged();
	FrontiersUI_ETargetWidgetType GetTargetType();
	class AActor* GetSelectedActor();
	class UPanelWidget* GetPanel();
	class UWidget* GetOverallVisibilityContainer();
};

// Class FrontiersUI.BossInfoWidget
// 0x0000 (FullSize[0x0718] - InheritedSize[0x0718])
class UBossInfoWidget : public UTargetInfoWidgetContainer
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BossInfoWidget");
		return ptr;
	}



};

// Class FrontiersUI.ButtonListWidget
// 0x0010 (FullSize[0x0260] - InheritedSize[0x0250])
class UButtonListWidget : public UListWidget
{
public:
	class UClass*                                      ButtonStyle;                                               // 0x0250(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      TextStyle;                                                 // 0x0258(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ButtonListWidget");
		return ptr;
	}



};

// Class FrontiersUI.BuybackItemListWidget
// 0x0010 (FullSize[0x0260] - InheritedSize[0x0250])
class UBuybackItemListWidget : public UListWidget
{
public:
	class UClass*                                      ComparisonWidgetClass;                                     // 0x0250(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryComparisonWidget*                  ComparisonWidget;                                          // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BuybackItemListWidget");
		return ptr;
	}



};

// Class FrontiersUI.VendorInventoryEntryWidget
// 0x02C8 (FullSize[0x0908] - InheritedSize[0x0640])
class UVendorInventoryEntryWidget : public UTLUserWidget
{
public:
	struct FUIButtonAction                             BuyAction;                                                 // 0x0640(0x00F8) (Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FUIButtonAction                             BulkBuyAction;                                             // 0x0738(0x00F8) (Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J5AL[0xD8];                                    // 0x0830(0x00D8) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.VendorInventoryEntryWidget");
		return ptr;
	}



	class UCatalogEntryWidget* GetCatalogEntryWidget();
	void Buy();
	void BulkBuy();
};

// Class FrontiersUI.BuybackItemWidget
// 0x0008 (FullSize[0x0910] - InheritedSize[0x0908])
class UBuybackItemWidget : public UVendorInventoryEntryWidget
{
public:
	unsigned char                                      UnknownData_Q7T4[0x8];                                     // 0x0908(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BuybackItemWidget");
		return ptr;
	}



	class UInventoryItemWidget* GetItemWidget();
};

// Class FrontiersUI.CarouselWidget
// 0x0008 (FullSize[0x0648] - InheritedSize[0x0640])
class UCarouselWidget : public UTLUserWidget
{
public:
	int                                                SelectedIndex;                                             // 0x0640(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_QXQ0[0x4];                                     // 0x0644(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.CarouselWidget");
		return ptr;
	}



	void SelectPrevious();
	void SelectNext();
	int GetNumOptions();
	class UTLTextBlock* GetCountText();
	UMG_ESlateVisibility GetArrowVisibility();
};

// Class FrontiersUI.CatalogEntryWidget
// 0x0030 (FullSize[0x0670] - InheritedSize[0x0640])
class UCatalogEntryWidget : public UTLUserWidget
{
public:
	struct FText                                       Name;                                                      // 0x0640(0x0018) (BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FText                                       ShortDescription;                                          // 0x0658(0x0018) (BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.CatalogEntryWidget");
		return ptr;
	}



	class UGenericResourceWidget* GetIconWidget();
	TArray<class UWidget*> GetCurrencyCountWidgets();
	class UGenericResourceWidget* GetCostWidget();
};

// Class FrontiersUI.TargetInfoWidget
// 0x0088 (FullSize[0x06C8] - InheritedSize[0x0640])
class UTargetInfoWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_9O7A[0x30];                                    // 0x0640(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UTargetInfoWidgetContainer*                  ParentContainer;                                           // 0x0670(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UHPBarFragment*>                      HPBarFragments;                                            // 0x0678(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UClass*                                      HPBarFragmentClass;                                        // 0x0688(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_2OVR[0x8];                                     // 0x0690(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MinTimeBetweenBarFragments;                                // 0x0698(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_DG9R[0x14];                                    // 0x069C(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FWidgetElementArray>                 WidgetElementsByType;                                      // 0x06B0(0x0010) (ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UTLTextBlock*                                NameTextBlock;                                             // 0x06C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TargetInfoWidget");
		return ptr;
	}



	TArray<class UWidget*> GetWidgetElements(FrontiersUI_ETargetInfoWidgetElement Element);
	class AActor* GetSelectedActor();
	class UTLTextBlock* GetNameTextBlock();
	void AddHPFragmentToPanel(class UHPBarFragment* Fragment);
};

// Class FrontiersUI.ChampionTargetInfoWidget
// 0x0050 (FullSize[0x0718] - InheritedSize[0x06C8])
class UChampionTargetInfoWidget : public UTargetInfoWidget
{
public:
	TMap<Frontiers_EMonsterSpawnType, struct FChampionTargetDisplayData> ChampionDisplayData;                                       // 0x06C8(0x0050) (Edit, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ChampionTargetInfoWidget");
		return ptr;
	}



};

// Class FrontiersUI.TabbedMenuWidget
// 0x00E8 (FullSize[0x0728] - InheritedSize[0x0640])
class UTabbedMenuWidget : public UTLUserWidget
{
public:
	TArray<struct FTabbedMenuOption>                   TabbedMenus;                                               // 0x0640(0x0010) (Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                               bCanReopenMenus;                                           // 0x0650(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LEEX[0x7];                                     // 0x0651(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FKey                                        NavigateLeftKey;                                           // 0x0658(0x0018) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                        NavigateRightKey;                                          // 0x0670(0x0018) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTabbedMenuOption                           PersistentMenuOption;                                      // 0x0688(0x0070) (Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                               bHideTabNames;                                             // 0x06F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRouteInputToSubMenu;                                      // 0x06F9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BAVB[0x6];                                     // 0x06FA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UTLUserWidget*>                       PersistentWidgets;                                         // 0x0700(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_L5CR[0x18];                                    // 0x0710(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.TabbedMenuWidget");
		return ptr;
	}



	void SetOptionEnabled(int Index, bool bEnabled);
	void MoveSelectionRight();
	void MoveSelectionLeft();
	class UTabbedMenuWidget* GetSubMenu();
	class UTLTextBlock* GetMenuHeader();
	class UTabbedMenuButtonList* GetMenuButtonList();
	class UWidget* GetCurrentDisplayedWidget();
	class UCanvasPanel* GetCanvasPanel();
	void BlueprintOnOptionSelected(const struct FTabbedMenuOption& Option);
};

// Class FrontiersUI.CharacterMenuHeader
// 0x0000 (FullSize[0x0728] - InheritedSize[0x0728])
class UCharacterMenuHeader : public UTabbedMenuWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.CharacterMenuHeader");
		return ptr;
	}



	UMG_ESlateVisibility GetSkillAlertVisibility();
	UMG_ESlateVisibility GetContractAlertVisibility();
	struct FText GetContractAlertText();
};

// Class FrontiersUI.ChatMessageListWidget
// 0x0008 (FullSize[0x0258] - InheritedSize[0x0250])
class UChatMessageListWidget : public UListWidget
{
public:
	int                                                MaximumMessages;                                           // 0x0250(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QRD7[0x4];                                     // 0x0254(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ChatMessageListWidget");
		return ptr;
	}



};

// Class FrontiersUI.ChatMessageWidget
// 0x0060 (FullSize[0x02C0] - InheritedSize[0x0260])
class UChatMessageWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData_4V8R[0x60];                                    // 0x0260(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ChatMessageWidget");
		return ptr;
	}



	void OnClicked();
	class UTLRichTextBlock* GetTextBlock();
	class UMenuAnchor* GetSocialMenuAnchor();
};

// Class FrontiersUI.ChatWidget
// 0x00C8 (FullSize[0x0708] - InheritedSize[0x0640])
class UChatWidget : public UTLUserWidget
{
public:
	float                                              FadeDelay;                                                 // 0x0640(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7PG1[0x4];                                     // 0x0644(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FChannelUIDefinition>                ChannelDefinitions;                                        // 0x0648(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FKey                                        CycleChannelKey;                                           // 0x0658(0x0018) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       HelpText;                                                  // 0x0670(0x0018) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IOOR[0x48];                                    // 0x0688(0x0048) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               bFadedOut;                                                 // 0x06D0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_0UZG[0xB];                                     // 0x06D1(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FLinearColor                                CurrentChannelColor;                                       // 0x06DC(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_OTEB[0x4];                                     // 0x06EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       CurrentChannelHeader;                                      // 0x06F0(0x0018) (BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.ChatWidget");
		return ptr;
	}



	void UpdateTextChatEnabled();
	void UpdateChatOpacity();
	void SetTextEntry(const struct FText& Text);
	void SendMessage();
	void OnMessageTextCommitted(const struct FText& Text, TEnumAsByte<SlateCore_ETextCommit> CommitType);
	void OnMessageTextChanged(const struct FText& Text);
	class UChatMessageListWidget* GetChatMessageList();
	class UEditableTextBox* GetChatMessageEditableTextBox();
	UMG_ESlateVisibility GetChannelNameVisibility();
	void FocusTextEntry();
	void FadeOutChat();
	void FadeInChat();
	void BlueprintSetCanEverChat(bool bCanEverChat);
};

// Class FrontiersUI.CinematicWidget
// 0x0028 (FullSize[0x0668] - InheritedSize[0x0640])
class UCinematicWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_7UBB[0x18];                                    // 0x0640(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ConfirmationHideTimeSeconds;                               // 0x0658(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ZAS2[0xC];                                     // 0x065C(0x000C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.CinematicWidget");
		return ptr;
	}



	void OnBackAction();
	class UTLUserWidget* GetConfirmationWidget();
};

// Class FrontiersUI.LevelSequenceCinematicWidget
// 0x0000 (FullSize[0x0668] - InheritedSize[0x0668])
class ULevelSequenceCinematicWidget : public UCinematicWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.LevelSequenceCinematicWidget");
		return ptr;
	}



};

// Class FrontiersUI.HUDElementNoTick
// 0x0000 (FullSize[0x0260] - InheritedSize[0x0260])
class UHUDElementNoTick : public UUserWidget
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.HUDElementNoTick");
		return ptr;
	}



};

// Class FrontiersUI.BaseClassResourceWidget
// 0x0050 (FullSize[0x0690] - InheritedSize[0x0640])
class UBaseClassResourceWidget : public UTLUserWidget
{
public:
	unsigned char                                      UnknownData_OW60[0x30];                                    // 0x0640(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FActiveTraitsTableRowHandle                 EnergyActiveTrait;                                         // 0x0670(0x0010) (Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UClass*                                      TooltipWidgetClass;                                        // 0x0680(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActiveTraitTooltipWidget*                   ActiveTraitTooltipWidget;                                  // 0x0688(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FrontiersUI.BaseClassResourceWidget");
		return ptr;
	}



};

// Class FrontiersUI.DuskMageResourceBar
// 0x0040 (FullSize[0x06D0] - InheritedSize[0x0690])
class UDuskMageResourceBar : public UBaseClassResourceWidget
{
public:
