#pragma once

// Name: Torchlight3, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass petowl_anim_charactercreate_bp.petowl_anim_charactercreate_bp_C
// 0x1010 (FullSize[0x1370] - InheritedSize[0x0360])
class Upetowl_anim_charactercreate_bp_C : public UTLCharacterSelectAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                         // 0x0368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                         // 0x0390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                         // 0x03B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                         // 0x03E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                         // 0x0408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                         // 0x0430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                         // 0x0458(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                         // 0x0480(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                         // 0x04A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x04D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x04F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0520(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0548(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0570(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x0598(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x05C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x05E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x0610(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x0638(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x0660(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x0688(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x06B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x06D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x0700(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x0728(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x0750(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x07D0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x0800(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x0880(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x08B0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x0930(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x0960(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x09E0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x0A10(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x0A90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x0AC0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x0B40(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x0B70(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x0BF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x0C20(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x0CA0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x0CD0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x0D50(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x0D80(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x0E00(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x0E30(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x0EB0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x0EE0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x0F60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x0F90(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x1010(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x1040(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x10C0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x10F0(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend;                                 // 0x11A0(0x00C8)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot;                                // 0x1268(0x0090)
	struct FAnimNode_Slot                              AnimGraphNode_Slot;                                        // 0x12F8(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x1340(0x0030)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass petowl_anim_charactercreate_bp.petowl_anim_charactercreate_bp_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_32FD85D04A54C1BF2CE14689B6CEA66E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_507C655C4AC6C7696500098EBA5E6BF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_2022627C403CB23C8C78C89E38DCA1D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_A6E5AD73484DF72DB9AB7487A341FC56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_EA8EF45C47FE836A5D118CA6EF130E0B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_7C0A6F154B6F3AE4D5B215B5BCB1DF51();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_720E963A4D96E05CD6E2F585DEE69241();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_B5D231CA492F4A4FC01C2EA9BF031859();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_868C68034521F3FCB73AD497FB00080A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_6D23BE8D4B9021890C29339C7A329F54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_BA86477740CD7A88949EE485797A207C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_A4DC93644AC7C8352FEF058E8629975C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_ED24B9B6455579F02938B2980C17C909();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_0EA2E530456C13E7DED10DA6FED764C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_103C9C1A430C120232A393AEA56FDC26();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_F99A0E6245660C3B2941C4B385789366();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_82A4DF6E496A09B8A30E76A3E1138046();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_7F81982940AFB6C25D9988A5BEF64813();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_F932BF2742FC43739A6E25B2FF73FF25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_410C485C4C1CFB60923CBCBCCB368EBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_7ABD0548475B2BAAD43F51B74630D310();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_9502BEB141F4B41A686B639B439F92D6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_2DC132B04577C054E6C801A5BF0CF1F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_246943BC4367839762B2F7BFB5A55E4B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_D48372364F86E9FE3091ED8148454122();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_1B4A8BB94669A29A5052BAB9B73BF971();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_2D20FD234497FA64CEDA4BBE36A44AED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_AD964D234C14B52047E182AB01E5202C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_91245F9745C834881AC77F9DC44A2EE7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petowl_anim_charactercreate_bp_AnimGraphNode_TransitionResult_B103E9684D39158A997CAAA1BEFB0674();
	void ExecuteUbergraph_petowl_anim_charactercreate_bp(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
