#pragma once

// Name: Torchlight3, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass petretriever_anim_charactercreate_bp.petretriever_anim_charactercreate_bp_C
// 0x1010 (FullSize[0x1370] - InheritedSize[0x0360])
class Upetretriever_anim_charactercreate_bp_C : public UTLCharacterSelectAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                         // 0x0368(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                         // 0x0390(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                         // 0x03B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                         // 0x03E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                         // 0x0408(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                         // 0x0430(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                         // 0x0458(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                         // 0x0480(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                         // 0x04A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                         // 0x04D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                         // 0x04F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                         // 0x0520(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                         // 0x0548(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                         // 0x0570(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                         // 0x0598(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                         // 0x05C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                          // 0x05E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                          // 0x0610(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                          // 0x0638(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                          // 0x0660(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                          // 0x0688(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                          // 0x06B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                          // 0x06D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                          // 0x0700(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                            // 0x0728(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                           // 0x0750(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                              // 0x07D0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                           // 0x0800(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                              // 0x0880(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                           // 0x08B0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                              // 0x0930(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                           // 0x0960(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                              // 0x09E0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                           // 0x0A10(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                              // 0x0A90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                            // 0x0AC0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                               // 0x0B40(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                            // 0x0B70(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                               // 0x0BF0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                            // 0x0C20(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                               // 0x0CA0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                            // 0x0CD0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                               // 0x0D50(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                            // 0x0D80(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                               // 0x0E00(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                            // 0x0E30(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                               // 0x0EB0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                            // 0x0EE0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                               // 0x0F60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                            // 0x0F90(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                               // 0x1010(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                              // 0x1040(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                 // 0x10C0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                                // 0x10F0(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend;                                 // 0x11A0(0x00C8)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot;                                // 0x1268(0x0090)
	struct FAnimNode_Slot                              AnimGraphNode_Slot;                                        // 0x12F8(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                        // 0x1340(0x0030)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass petretriever_anim_charactercreate_bp.petretriever_anim_charactercreate_bp_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_A4B269714241A83343F6E1BC8F953FD7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_8B9E24B649178987723C00AE3C5826E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_AF11A11B42C8E1C07D19F19DB7392554();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_4E2FE14B4E14C7AA84AE6D884929EFBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_9201CD3E4546F99085A5D1BE338DD934();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_8D3AC26746EEBA3114ED8BBBFBD24F6B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_49D0A6A948496377243871947E6FCE71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_982513C84ED5E3514482E994E60A867A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_97CF46C2414956D60D1E6191DBD96FBB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_1A998EA04AA94981F1A2F89345F81DCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_A70353374113AC7FB271F58DEDDD5D4A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_90AF10D148AB7C7F5DC17D9229F3C669();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_A029BEE44AB9419F1BF08F9EAEBBEFDE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_SequencePlayer_994FEA06476DD8FB523ED4BC80728C6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_8216B6F940F6BB9FEEB13A9B1B55E306();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_01F51C7D447B32BA79593BB165E29273();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_399567134A7CC42EE598DF8617D7B902();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_1C1FAC024D48E7B45C936A90F5879B0E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_C0B529CE43773798360A6D94C719B3A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_1CF5B33441EF097E2A428EBD5B376EF6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_89F1F45E4BFCB10E7D1612964B990A42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_64EB932343C626CA24A8A08AAD0E2783();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_99386EC4417C1EC81E4A34B95B0B6E05();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_BABAF3A24ADD0454BF80A4871DF6EC2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_1635191B46D4B881C00FAC86C744A48B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_143DE9A44F171690560F4C8146AC18E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_26D62C0F4A8E531D02A623B6514F7E6A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_1A211CC7404BEA2EDCB05CAB065AD78C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_C574927546F86D395AAAD88403D999F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_petretriever_anim_charactercreate_bp_AnimGraphNode_TransitionResult_C2A4203547EADA4E3B03C2B767A2F321();
	void ExecuteUbergraph_petretriever_anim_charactercreate_bp(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
